#+STARTUP: inlineimages overview

*** Add more refile targets
In order to add more headings and files when using [[help:org-refile][org-refile]] command (=C-c C-w=), you can
customize the [[help:org-refile-targets][org-refile-targets]] variable.

Examples:
#+begin_src emacs-lisp
  (setq org-refile-targets
        '((nil . (:level . 1))  ;; Here nil means search only current buffer
          (org-agenda-files . (:maxlevel . 2)))) ;; Search in org-agenda files
#+end_src

#+RESULTS:
: ((nil :level . 1) (org-agenda-files :maxlevel . 2))
*** Working with buffers
There are several function for working with buffers

#+begin_src elisp :eval no
  ;; returns the buffer name
  (buffer-name)

  ;; returns the file name associated with the buffer
  (buffer-file-name)

  ;; returns the current buffer object
  (current-buffer)

  ;; returns the buffer object used before current-buffer
  (other-buffer)

  ;; Get buffer by name
  (get-buffer "*scratch*")

  ;; Switching to another buffer
  ;; Same as when pressing C-x b <buffer-name>
  (switch-to-buffer (other-buffer))

  ;; Set current buffer to...
  (set-buffer (other-buffer))
#+end_src

#+RESULTS:
: #<buffer init.el>
**** Buffer size and cursor

Determining the buffer size and the position of the cursor

#+begin_src elisp
  ;; Getting buffer size
  (buffer-size (current-buffer))

  ;; Getting the position of the cursor in the current buffer
  (point)

  ;; Getting the minimum position of the pointer (always 1?)
  (point-min)

  ;; Getting the max possible position of the pointer (always = buffer-size + 1?)
  (point-max)
#+end_src

#+RESULTS:
: 9074
*** Elisp ~if~ keyword :ATTACH:
:PROPERTIES:
:ID:       4eae3b16-b29e-46f2-9a54-af8448d62550
:END:
The if keyword can be used as follows in elisp:
For details on how =test= part decides where to go, see [[id:1d004eef-7276-403b-9ac8-d311d619f3e4][Predicates and boolean tests in elisp]]

#+begin_src elisp
  (defun test-point ()
    "Showcasing 'if' usage"
    (let ((pos (point)))
            (if (> pos 10)
                (message "Point is at position %d" pos
              (message "Point position too low (%d)" pos)))))
  (test-point)
#+end_src

#+RESULTS:
: Point is at position 13103

*** Constrol constructs
Common constrol constructs in lisp are:
+ IF statement. What makes them harder to use is that yuo can have only one form as =then= or =else= parts.
  If you want to extend this, you can use =progn=
  #+begin_src common-lisp
(if (cond)
    (then-form)
  (else-form))
  #+end_src
+ WHEN and UNLESS are constructs that also help with evaluating more forms conditionally.
  #+begin_src common-lisp
;; When something is true, execute the body
(when (condition)
  (form-1)
  (form-n))

;; When something is false, executer the body
(unless (condition)
  (form-1)
  (form-n))
  #+end_src
+ COND is a construct that helps write branches like if - else if - else
#+begin_src common-lisp
(cond ((< 1 0) (print "impossible"))
      ((= 1 2) (print "please no"))
      (t (print "This is the else")))
#+end_src

#+RESULTS:
: This is the else
